# SpanDirSymParamTop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpanDirSymParamTop Property
ParameterTypeId Class See Also
---
"Top"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpanDirSymParamTop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpanDirSymParamTop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpanDirSymParamTop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace